# программа "Загадки короля 1.0"

print("""Вы простой крестьянин, что украл немного еды для своей семьи, от бедной жизни.
Но вас поймали и собираются казнить на эшафоте.
На вашу казнь пришел чудаковатый король, который славится своими неоднозначными выходками.

Он приходит на казнь и объявляет, что даст крестьянину шанс на жизнь.

- Чудаковатый Король - 
"Ну что, воришка, я могу тебя помиловать для этого, ты должен отгадать мои загадки.
либо
одну сложную загадку, без вариантов ответа, с трёмя попытками
либо 
три обычных загадки, с вариантами ответа, можно ошибиться только один раз
Крестьянин я даю тебе выбор, определяйся с умом".

Введите цифру из предложенных вариантов,
1 - Сложная загадка, без вариантов ответа, с трёмя попытками
2 - Три простых загадки, с вариантами ответа, ошибиться только один раз

Вводить сюда $>""")

