print("Крестьянин отгадывает загадки\ку на удивление короля, "
"король называет его непростым крестьянином "
"и отпускает восвояси.")

PREHISTORY1 = """Крестьянин идёт домой без еды,
и подходя к тёмному переулку видит что туда идёт купец с крупными мешками чего-то ценного наперевес..
Выбор:  
1 - Пойти за ним
2 - Вернуться домой к семье 

"""

ENDING1 = """Вы возвращаетесь домой и ваша семья по прежнему голодает. ХЭПИ ЭНД!"""

ENDING2 = """Победа! Купец поблагодарил крестьянина и дал ему больше половины своих золотых монет.
Купец - Возьми, всё по честному!
Крестьянин простился с купцом и пошёл домой, что бы порадовать свою семью"""

ENDING3 = """Купец дал денег на еду и новую одежду крестьянину, и сказал что будет ждать его
у лавки через пару дней, там для него найдётся работа.
"""
ENDING4 = """Купец узнал что вы украли медальйон и усыпил вас порошком. 
все же очнувшись вы нашли в кармане пару серебряников"""
 

STORY1 = """Что-то заманило крестьянина идти за ним… у него были мысли и от том чтобы попытаться стащить мешочек у купца,
ведь у него их много, но может он и просто бы попросил сжалиться над ним и дать ему немного денег.. 
Мы уже никогда не узнаем что заставило его идти туда...

В темном переулке смрадно и мрачно. В это время там ни одной души,
ведь крестьяне на полях, а торговцы на площади. Стража там не ходит, потому что это окраина. 

Вы идете притаившись за ним и вдруг замечаете что из конца переулка навстречу купцу идут две темные фигуры.
Что вы будете делать:
1 - притаиться и наблюдать 
2 - убежать домой пока не поздно
3 - уйти из переулка и позвать стражу
"""

STORY2 = """Темные фигуры приблизились к купцу, он и носом не повёл. 
Это оказались разбойники, они остановили купца и потребовали отдать все что у него есть
Купец - Вот, возьмите мешок с золотом и убирайтесь..
Разбойник1 - Ого, ничего себе он богач!
Разбойник2 - Давай все что у тебя есть, а не то убьём.
Купец - что ж.. попробуйте.

Разбойник1 достал ржавый кинжал в сделал выпад вперёд на купца
Купец увернулся, взял один из мешков, которые были у него на поясе и контратаковал разбойнка по башке,
Разбойник2 спохватился за дубину, и попытался огреть купца, купец отпрыгнул но споткнулся и 
Разбойник1 снова нанёс удар кинжалом он не поранил купца но сорвал с него медальон 
медальон отлетает в сторону к крестьянину, он узнает знак на медальоне 
у его пропавшей матери был такой шрам на спине 
Что вы будете делать:
1 - Вмешаться
2 - Продолжить наблюдать
3 - Убежать
"""

STORY2_CHOICE1 = """Крестьянин выходит из укрытия, и устремился в сторону купца,
над которым уже навис нож Разбойника1. 
Крестьянин подбегает и отталкивает разбойника. 
На крестьянина набросился Разбойник2. 
Он замахнулся своей дубиной, но крестьянин стал её удерживать.
Разбойник1 отвлекся на мгновенье от поднявшегося шума, 
и купец бросил в него какую-то пыль из мешка, Разбойник1 тут же заснул
Разбойник2 Увидев это, бросил дубину и начал удирать со всех ног. 

Что вы будете делать:
1 - Попытаться догнать разбойника
2 - Подбежать к купцу
3 - остаться на месте 
"""

STORY2_CHOICE2 = """Вы продолжили наблюдать 
Купца ранили но он усыпил всех разбойников, а позже добрался и до тебя.
Проснувшись в грязи ты встал и поплёлся домой"""

# добавить характеристику ловкость за этот вариант 
STORY3_CHOICE1 = """Ты бежишь за разбойником и кидаешь в него дубинкой
разбойник падает... 
Купец подходит к тебе и говорит:
ловкий бросок, купец подходит к упавшему разбойнику 
и кидает в него немного усыпляющей пыли разбойник засыпает

- крестьянин: Что будем с ними делать они же проснуться и выследят нас чтобы отомстить!
- купец: они ничего не вспомнят 
- крестьянин: вы маг?
- купец: скорее маг торговли хахаха, это специальное вещество его делают в жители гор,
чтобы усмирять диких козлов. Впрочем спасибо тебе за помощь. Как мне тебя отблагодарить?

Что вы скажете купцу:
1 - Прошу вас дайте денег, мое семье нечего есть
2 - Подарите мне этот медальйон.  
3 - Дайте мне работу! 
"""

STORY3_CHOICE2 = """Ты подбегаешь к купцу и спрашиваешь 
Господин, вы ранены?
- купец: Всё в порядке. А ты смельчак! 
- крестьянин: Сложно не помочь человеку который попал в беду. 
Купец осмотрев грязного крестьянина в обносках. Сказал: 
- А я погляжу ты и сам в нее попал.
Впрочем спасибо тебе за помощь.
Дальше я сам.

Что вы скажете купцу:
1 - Прошу вас дайте денег, мое семье нечего есть
2 - Вы обранили медальйон. 
3 - Рад был стараться до встречи! 
"""

STORY3_CHOICE3 = """Ты застыл на месте в ступоре
К тебе подходит купец
Купец: Откуда ты тут взялся "герой"?
Крестьянин: Шел с казни. наслаждался свободой дай думаю по темному переулку пройдусь
Купец: А ты притягиваешь к себе неприятности. Впрочем спасибо тебе за помощь.

Что вы скажете купцу:
1 - Прошу вас дайте денег, мое семье нечего есть
2 - Вы обранили медальйон. ы
3 - Рад был стараться до встречи!
"""


user_choice = input(PREHISTORY1)

if user_choice == "1":
    user_choice = input(STORY1)
    if user_choice == "1":
        user_choice = input(STORY2)
        if user_choice == "1":
            user_choice = input(STORY2_CHOICE1)
            if user_choice == "1":
                user_choice = input(STORY3_CHOICE1)
                if user_choice == "1":
                    print(ENDING2)
                elif user_choice == "2":
                    print(ENDING3)
                elif user_choice == "3":
                    print(ENDING4)
                else:
                    print("Такого варианта нет!")
            elif user_choice == "2":
                user_choice = input(STORY3_CHOICE2)
                if user_choice == "1":
                    print(ENDING3)
                elif user_choice == "2":
                    print(ENDING2)
                elif user_choice == "3":
                    print(ENDING1)
                else:
                    print("Такого варианта нет!")
            elif user_choice == "3":
                user_choice = input(STORY3_CHOICE3)
                if user_choice == "1":
                    print(ENDING3)
                elif user_choice == "2":
                    print(ENDING2)
                elif user_choice == "3":
                    print(ENDING1)
                else:
                    print("Такого варианта нет!")
            else:
                print("Такого варианта нет!")
        elif user_choice == "2":
            user_choice = input(STORY2_CHOICE2)
        elif user_choice == "3":
            print(ENDING1)
        else:
            print("Такого варианта нет!")

    elif user_choice == "2":
        print(ENDING1)
    elif user_choice == "3":
        print("Вы уходите из переулка и зовете стражу, вернушись со старжей обнарживаете лишь засохшие остатки крови")
        print(ENDING1)
    else:
        print("Такого варианта нет!")

elif user_choice == "2":
    print(ENDING1)
else:
    print("Такого варианта нет!")

